app/views/budgets/display.html.erb


<%= pie_chart Expense.group(:expensetype, :month, :year).sum(:projvalue)%>
<!-- <%=pie_chart Income.group(:incometype, :month, :year).sum(:value)%> -->
---
SELECT "expenses".* FROM "expenses"  ORDER BY "expenses"."projvalue" ASC
SELECT SUM("expenses"."projvalue") AS sum_projvalue, expensetype AS expensetype, month AS month, year AS year FROM "expenses" GROUP BY "expenses"."expensetype", "expenses"."month", "expenses"."year"
SELECT "incomes".* FROM "incomes"
SELECT SUM("incomes"."value") AS sum_value, incometype AS incometype, month AS month, year AS year FROM "incomes" GROUP BY "incomes"."incometype", "incomes"."month", "incomes"."year"