app/controllers/bills_controller.rb

  def create
    @bill = Bill.new(bill_params)
    if user_signed_in?
      @bill.user_id = current_user.id
    end

    respond_to do |format|
      if @bill.save
---
INSERT INTO "bills" ("expenseid", "day_month", "month", "year", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["expenseid", "hi"], ["day_month", 10], ["month", 10], ["year", 1999], ["created_at", "2016-03-03 01:30:10.503496"], ["updated_at", "2016-03-03 01:30:10.503496"]]

    def set_bill
      @bill = Bill.find(params[:id])
---
SELECT  "bills".* FROM "bills" WHERE "bills"."id" = ? LIMIT 1  [["id", 980190962]]