app/controllers/expenses_controller.rb

  def create
    @expense = Expense.new(expense_params)
    if user_signed_in?
      @expense.user_id = current_user.id
    end

    respond_to do |format|
      if @expense.save
---
INSERT INTO "expenses" ("expensetype", "frequency", "projvalue", "actvalue", "percent", "month", "year", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)