app/controllers/incomes_controller.rb

SELECT "incomes".* FROM "incomes"
---
  def index
    @incomes = Income.all

INSERT INTO "incomes" ("income", "incometype", "value", "frequency", "day_rec", "month", "year", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @income = Income.new(income_params)

    respond_to do |format|
      if @income.save

SELECT  "incomes".* FROM "incomes" WHERE "incomes"."id" = ? LIMIT 1  [["id", 980190962]]
---
    def set_income
      @income = Income.find(params[:id])